import os
import pytz

# ======================================
# LINE
# ======================================

LINE_CHANNEL_ACCESS_TOKEN = os.getenv(
    "LINE_CHANNEL_ACCESS_TOKEN",
    ""
)

LINE_CHANNEL_SECRET = os.getenv(
    "LINE_CHANNEL_SECRET",
    ""
)

# ======================================
# 管理員
# ======================================

ADMIN_USERS = [

    # 放你的UserID
    # "Uxxxxxxxxxxxxxxxxxxxxxxxx"

]

# ======================================
# 台灣時區
# ======================================

TIMEZONE = pytz.timezone(
    "Asia/Taipei"
)

# ======================================
# Data
# ======================================

DATA_FILE = "data.json"

# ======================================
# 固定成員
# ======================================

DEFAULT_MEMBERS = [

    "造賓",
    "佳真",
    "宗旂",
    "培昇",
    "季家",
    "佳峻",
    "彥呈",
    "欣雯"

]

# ======================================
# 每日發送時間
# ======================================

SEND_HOUR = 14
SEND_MINUTE = 55
